benchmark/wrk2/map-t2-c20.txt
Running 5s test @ http://127.0.0.1:8091/v1/search/map/prices
  2 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.50ms    2.44ms  19.81ms   88.22%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.66ms
 75.000%    2.44ms
 90.000%    5.59ms
 99.000%   12.73ms
 99.900%   17.12ms
 99.990%   19.42ms
 99.999%   19.82ms
100.000%   19.82ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.370     0.000000            1         1.00
       0.879     0.100000          996         1.11
       1.104     0.200000         1994         1.25
       1.296     0.300000         2995         1.43
       1.486     0.400000         3994         1.67
       1.664     0.500000         4980         2.00
       1.775     0.550000         5481         2.22
       1.909     0.600000         5978         2.50
       2.046     0.650000         6477         2.86
       2.213     0.700000         6975         3.33
       2.445     0.750000         7473         4.00
       2.625     0.775000         7720         4.44
       2.889     0.800000         7968         5.00
       3.321     0.825000         8219         5.71
       3.927     0.850000         8466         6.67
       4.715     0.875000         8715         8.00
       5.115     0.887500         8840         8.89
       5.587     0.900000         8964        10.00
       6.135     0.912500         9091        11.43
       6.695     0.925000         9213        13.33
       7.307     0.937500         9338        16.00
       7.647     0.943750         9401        17.78
       8.051     0.950000         9463        20.00
       8.415     0.956250         9526        22.86
       8.919     0.962500         9588        26.67
       9.495     0.968750         9649        32.00
       9.783     0.971875         9681        35.56
      10.159     0.975000         9711        40.00
      10.479     0.978125         9744        45.71
      10.959     0.981250         9774        53.33
      11.431     0.984375         9805        64.00
      11.735     0.985938         9822        71.11
      12.055     0.987500         9836        80.00
      12.511     0.989062         9852        91.43
      12.807     0.990625         9867       106.67
      13.191     0.992188         9883       128.00
      13.415     0.992969         9891       142.22
      13.663     0.993750         9898       160.00
      13.951     0.994531         9906       182.86
      14.375     0.995313         9914       213.33
      14.735     0.996094         9922       256.00
      14.847     0.996484         9925       284.44
      15.151     0.996875         9929       320.00
      15.287     0.997266         9933       365.71
      15.439     0.997656         9937       426.67
      16.039     0.998047         9941       512.00
      16.079     0.998242         9943       568.89
      16.399     0.998437         9945       640.00
      16.639     0.998633         9947       731.43
      16.911     0.998828         9949       853.33
      17.583     0.999023         9951      1024.00
      17.663     0.999121         9952      1137.78
      17.967     0.999219         9953      1280.00
      18.127     0.999316         9954      1462.86
      18.239     0.999414         9955      1706.67
      18.639     0.999512         9956      2048.00
      18.639     0.999561         9956      2275.56
      19.071     0.999609         9957      2560.00
      19.071     0.999658         9957      2925.71
      19.311     0.999707         9958      3413.33
      19.311     0.999756         9958      4096.00
      19.311     0.999780         9958      4551.11
      19.423     0.999805         9959      5120.00
      19.423     0.999829         9959      5851.43
      19.423     0.999854         9959      6826.67
      19.423     0.999878         9959      8192.00
      19.423     0.999890         9959      9102.22
      19.823     0.999902         9960     10240.00
      19.823     1.000000         9960          inf
#[Mean    =        2.499, StdDeviation   =        2.436]
#[Max     =       19.808, Total count    =         9960]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9962 requests in 5.00s, 1.94MB read
Requests/sec:   1991.92
Transfer/sec:    396.83KB